In [1]:
print("Pandas!")

Pandas!

In [2]:
# Load pandas library
import pandas as pd

In [3]:
# Pandas Datatypes
# DataFrame*
# Series

# Series

In [5]:
s = pd.Series([10,20,30,40,50])
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

# DataFrame

In [8]:
data = {
    'Name' : ['Alice','Bob', 'Charlie'],
    'Age' : [25,30,22],
    'City' : ['New York','San Francisco', 'Los Angeles']
}

df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles

In [9]:
# Data Shape
df.shape

(3, 3)

In [11]:
print(df.shape)

(3, 3)

In [16]:
print("Row:",df.shape[0])
print("Col:",df.shape[1])

Row: 3
Col: 3

In [18]:
df.head() # Returns first 5 rows by default

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles

In [19]:
df.head(2)

    Name  Age           City
0  Alice   25       New York
1    Bob   30  San Francisco

In [20]:
df.tail() # Returns last 5 rows by default

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles

In [21]:
df.tail(1)

      Name  Age         City
2  Charlie   22  Los Angeles

In [22]:
# Columns
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [25]:
# Specific Columns
df.Name

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [27]:
df['Name'] # Preferred

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [29]:
df[['Name','Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22

In [32]:
df['Age'].max()

30

In [33]:
df['Age'].min()

22

In [34]:
df[df['Age']>22]

    Name  Age           City
0  Alice   25       New York
1    Bob   30  San Francisco

In [36]:
df[df['Age']<30]

      Name  Age         City
0    Alice   25     New York
2  Charlie   22  Los Angeles

In [38]:
df.loc[1]

Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [40]:
df.loc[2]

Name        Charlie
Age              22
City    Los Angeles
Name: 2, dtype: object

# Load Dataset

In [41]:
df = pd.read_csv('iris.csv')

In [42]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [43]:
df.shape

(150, 5)

In [45]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [46]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [47]:
df.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [49]:
df.sepal_length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [51]:
df.sepal_length.max()

7.9

In [52]:
df.sepal_length.min()

4.3

In [53]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [56]:
df.info() # Generate a dataset report summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [57]:
df.describe() # See the dataset statistical summary

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [61]:
df['petal_width'].unique()

array([0.2, 0.4, 0.3, 0.1, 0.5, 0.6, 1.4, 1.5, 1.3, 1.6, 1. , 1.1, 1.8,
       1.2, 1.7, 2.5, 1.9, 2.1, 2.2, 2. , 2.4, 2.3])

In [62]:
df.species.value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64